Revit 2027 API
StructuralAsset.ThermalExpansionCoefficient Property
 The thermal expansion coefficient of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ThermalExpansionCoefficient { get; set; }
Public Property ThermalExpansionCoefficient As XYZ
	Get
	Set
public:
property XYZ^ ThermalExpansionCoefficient {
	XYZ^ get ();
	void set (XYZ^ value);
}
member ThermalExpansionCoefficient : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InapplicableDataException |  When setting this property: the material type is wood. -or- When setting this property: the behavior is isotropic.
Remarks
 This property cannot be used to set the thermal expansion coefficient for wood-based and isotropic materials. For such assets, use setThermalExpansionCoefficient instead. The value is in inverse Kelvin (1/K).
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace